[
{
  "category": "Charity Events",
  "site": "gosh",
  "url": "https://www.gosh.org/get-involved/fundraising-events/",
  "name": "Charity fundraising events",
  "date": "01/24/2026",
  "raw_date": "24 Jan 2026",
  "short_description": "Whether it's running a half marathon, climbing the steps of the Walkie Talkie, or enjoying one of our seasonal celebrations, take part in a fundraising event and help give seriously ill children the...",
  "coordinates": {
    "lat": 51.523323,
    "lon": -0.124458
  },
  "address": "4) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
  "subcategory": "Charity Events",
  "raw": {
    "title": "Charity fundraising events",
    "date": "01/24/2026",
    "desc_preview": "Whether it's running a half marathon, climbing the steps of the Walkie Talkie, or enjoying one of our seasonal celebrations, take part in a fundraising event and help give seriously ill children the...",
    "full_description": "Whether it's running a half marathon, climbing the steps of the Walkie Talkie, or enjoying one of our seasonal celebrations, take part in a fundraising event and help give seriously ill children the best chance and the best childhood possible. For the hundreds of children from all over the UK who are treated by Great Ormond Street Hospital every day, for children with rare or complex illnesses everywhere, for this generation and all those to come. Be part of it. 24 Jan 2026\n                \n                 to \n                25 Jan 2026 Take on the London Winter Walk and trek for seriously ill children at Great Ormond Street Hospital. 1 Feb 2026\n                \n                 to \n                28 Feb 2026 Run 100km in February to raise money for Great Ormond Street Hospital Children's Charity 8 Mar 2026 Join us for a unique half marathon experience in the most beautiful city in the world. 15 Mar 2026 Join us for a unique running experience in the only half marathon to start and finish at a historic royal palace. 15 Mar 2026 Be part of this picturesque half marathon. Great Ormond Street Hospital Children's Charity. A company limited by guarantee (company number ‍09338724) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
    "address": "4) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
    "coordinates": {
      "lat": 51.523323,
      "lon": -0.124458
    }
  }
},
{
  "category": "Charity Events",
  "site": "gosh",
  "url": "https://www.gosh.org/get-involved/fundraising-events/brighton-marathon/",
  "name": "Brighton Marathon 2026",
  "date": "04/12/2026",
  "raw_date": "12 April 2026",
  "short_description": "Take on the Brighton Marathon 2026 - a scenic marathon around one of Britain's most vibrant cities - whilst raising money to help Great Ormond Street Hospital Children's Charity.",
  "coordinates": {
    "lat": 51.523323,
    "lon": -0.124458
  },
  "address": "4) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
  "subcategory": "Charity Events",
  "raw": {
    "title": "Brighton Marathon 2026",
    "date": "04/12/2026",
    "desc_preview": "Take on the Brighton Marathon 2026 - a scenic marathon around one of Britain's most vibrant cities - whilst raising money to help Great Ormond Street Hospital Children's Charity.",
    "full_description": "Take on the Brighton Marathon 2026 - a scenic marathon around one of Britain's most vibrant cities - whilst raising money to help Great Ormond Street Hospital Children's Charity. Be a hero. Help save childhood. It’s time to get moving! Kickstart your new year by signing up to a challenge today and become a TeamGOSH hero in 2026. Until no childhood is lost to serious illness. Be part of it. Be a TeamGOSH hero today. Use code when you register for 50% off your fun-raising challenge and be a hero for childhood, for families, for seriously ill kids, for this generation and all those to come. Enjoying breath-taking views as you clock up the miles, you'll be making a life-changing difference to the seriously ill children and young people who arrive at Great Ormond Street Hospital every day. 26.2 miles Sunday 12 April 2026 Brighton & Hove Fundraising pledge: £500 Registration fee: £30 (£15 with code NY50) Starting at Preston Park and finishing at Hove Lawns, this 26.2 mile run is one of the UK's biggest and best marathons. The route takes you into Withdean before the turn back towards the city. Passing the Pavilion, you'll head up into Kemptown before following the coast to Ovingdean. Take a final turn back for a breath-taking view of the city, running along the promenade and into Hove before a fabulous finish at the beach village. Secure your place on the start line by registering for one of our chaity places today. If you've secured your own place in the 2026 Brighton Marathon, we’d love for you to join TeamGOSH and run for us. As you have your own place in the event, there is no minimum fundraising commitment; we only ask you to raise what you can. a complimentary professional running vest access to professional training plans encouragement along the route from our cheer team a digital welcome pack full of fundraising tips & advice unlimited support from our Challenge Events Team GOSH Charity supports life-saving child health research across the country, as well as investing in vital support services, the latest medical technology, and world-class facilities for the children who depend on Great Ormond Street Hospital. Your run can make a huge difference. If you have any questions about the Brighton Marathon or the fundraising requirements, please feel free to get in touch with our challenge events team, who will be happy to help at £500 minimum fundraising pledge. We recommend setting up an Enthuse or JustGiving fundraising page, take a look at the ' ' section of the website. Please get in touch if you need support with your fundraising. Yes, you'll be asked your vest size on registration. We will share details of the GOSH Charity cheer point to all participants closer to event day to share with family and friends. Great Ormond Street Hospital Children's Charity. A company limited by guarantee (company number ‍09338724) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
    "address": "4) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
    "coordinates": {
      "lat": 51.523323,
      "lon": -0.124458
    }
  }
},
{
  "category": "Charity Events",
  "site": "gosh",
  "url": "https://www.gosh.org/get-involved/fundraising-events/london-landmarks-half-marathon/",
  "name": "London Landmarks Half Marathon 2026",
  "date": "04/12/2026",
  "raw_date": "12 April 2026",
  "short_description": "The London Landmarks Half Marathon is a exciting, closed-road run taking you past some of the city's famous attractions and beautiful views.",
  "coordinates": {
    "lat": 51.523323,
    "lon": -0.124458
  },
  "address": "4) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
  "subcategory": "Charity Events",
  "raw": {
    "title": "London Landmarks Half Marathon 2026",
    "date": "04/12/2026",
    "desc_preview": "The London Landmarks Half Marathon is a exciting, closed-road run taking you past some of the city's famous attractions and beautiful views.",
    "full_description": "The London Landmarks Half Marathon is a exciting, closed-road run taking you past some of the city's famous attractions and beautiful views. With a flat route and fantastic atmosphere, it's the perfect half marathon for beginners or experienced runners chasing a personal best. You'll start on Pall Mall and run through central London, crossing the historic Westminster Bridge to finish by Downing Street. The route takes in impressive views of Big Ben, St Paul's Cathedral, Nelson's Column, the Gherkin, the Shard, the Tower of London and the London Eye. 13.1 miles Sunday 12 April 2026 London Fundraising pledge: £350 Registration fee: £30 The London Landmarks Half Marathon (LLHM) takes place on Sunday 12 April 2026 Charity places for the London Landmarks Half Marathon 2026 have Join our waiting list below and we'll be in touch if one becomes available. If you're lucky enough to secure your own place through the 2026 ballot, we’d love for you to join our team and fundraise to help seriously ill children at Great Ormond Street Hospital. There’s no minimum fundraising commitment – we simply ask you to raise what you can. Whether you join via a charity place or the public ballot, you'll receive the same amazing support from our dedicated team. A GOSH Charity running vest Access to professional training plans. A digital welcome pack with tips, advice and fundraising materials. A themed GOSH Charity cheering point that your friends and family can join. Dedicated support from GOSH Charity's Challenge Events team. The London Landmarks Half Marathon is wheelchair accessible and the fantastic route should provide a comfortable event experience for all. We would love to welcome participants of all abilities to our team, to apply for an accessible place please . The start line for the London Landmarks Half Marathon is on Pall Mall and finishes on Downing Street. The route includes iconic landmarks such as Big Ben, Nelson's Column in Trafalgar Square, the Royal Courts of Justice, St Paul's Cathedral, The Gherkin, Tower Bridge and many more. If running past beautiful landmarks wasn't enough, the route is filled with DJs, dancers, musical performances and themed cheer stations. “ Running the LLHM was a brilliant experience from start to finish - I started running only two years ago and had never run the distance before, but I trusted in my 12-week training plan and lots of advice from my much more experienced running friends\" \"The day itself was hard work as expected, but a lot more fun than I expected! I was quite nervous and took my headphones in case I needed the motivation, but I barely listened to any of my own music as the route was packed with supporters, bands and choirs and most importantly, all the cheer stations of the different charities. Obviously the GOSH Charity cheer station was the best(!) and I actually speeded up after seeing them and my family and friends nearby\" \"I was running because GOSH is a cause very close to my heart as they have looked after my son for his whole life. I was so happy to be able to raise money for such a good cause. The team at GOSH Charity were really supportive and encouraging throughout the whole experience“ This year, we hope to raise over £340,000 at the 2026 London Landmarks Half Marathon to help build the new at GOSH. GOSH already cares for children with the hardest to treat cancers, and new treatments are giving hope to children and their families. But these advances have outstripped GOSH's current cancer facilities. We need a new home for breakthrough treatments and pioneering research, so we can save more children's lives. And because cancer shouldn't get to steal anyone's childhood, we need a place that's more than a hospital – a place that's a school, a playground, a garden, and so much more. That's why we're building a world-leading, child focused Children's Cancer Centre, where more children can have the best chance and the best childhood possible. Great Ormond Street Hospital Children's Charity. A company limited by guarantee (company number ‍09338724) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
    "address": "4) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
    "coordinates": {
      "lat": 51.523323,
      "lon": -0.124458
    }
  }
},
{
  "category": "Charity Events",
  "site": "gosh",
  "url": "https://www.gosh.org/get-involved/fundraising-events/bath-challenge/",
  "name": "Bath 50 Challenge 2026",
  "date": "03/28/2026",
  "raw_date": "28 March 2026",
  "short_description": "Centred on this elegant historic city, take on a 50 km Ultra, a testing 29 km, or a sharp 10 km challenge at your pace",
  "coordinates": {
    "lat": 51.523323,
    "lon": -0.124458
  },
  "address": "4) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
  "subcategory": "Charity Events",
  "raw": {
    "title": "Bath 50 Challenge 2026",
    "date": "03/28/2026",
    "desc_preview": "Centred on this elegant historic city, take on a 50 km Ultra, a testing 29 km, or a sharp 10 km challenge at your pace",
    "full_description": "Centred on this elegant historic city, take on a 50 km Ultra, a testing 29 km, or a sharp 10 km challenge at your pace From our Bath Racecourse basecamp 2000 adventurers will head out on looped routes around and through Bath – with fantastic panoramic views, past the famous Royal Crescent, along the River Avon and taking in many of the city’s sights and sounds and surrounding countryside. With 50km, 29km, and 10km challenge options also available, there's a challenge for everyone. You can join as an individual or as a team. 28 March 2026 Bath Fundraising pledge: £70 - £375 Registration fee: £20 - £139 Visit the Ultra Challenge website for full details on distances, prices, and to sign up. Great Ormond Street Hospital Charity (GOSH Charity) needs your support more than ever. By fundraising, you'll help to fund: A GOSH Charity t-shirt Dedicated support from GOSH Charity's Challenge Events team Inclusive and fun event with a great atmosphere and camaraderie A fully signed route, with a team of ‘Trekmasters’ out on the trail with you Regular covered rest stops, with free food and drink, massages and medics An epic finish line moment, with a glass of fizz, medal and t-shirt Lace up those walking boots and trek for seriously ill children at Great Ormond Street Hospital. Great Ormond Street Hospital Children's Charity. A company limited by guarantee (company number ‍09338724) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
    "address": "4) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
    "coordinates": {
      "lat": 51.523323,
      "lon": -0.124458
    }
  }
},
{
  "category": "Charity Events",
  "site": "gosh",
  "url": "https://www.gosh.org/get-involved/fundraising-events/walkie-talkie-tower-climb/",
  "name": "Walkie Talkie Tower Climb 2026",
  "date": "03/28/2026",
  "raw_date": "28 March 2026",
  "short_description": "Be a hero. Help save childhood.",
  "coordinates": {
    "lat": 51.523323,
    "lon": -0.124458
  },
  "address": "4) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
  "subcategory": "Charity Events",
  "raw": {
    "title": "Walkie Talkie Tower Climb 2026",
    "date": "03/28/2026",
    "desc_preview": "Be a hero. Help save childhood.",
    "full_description": "Be a hero. Help save childhood. It’s time to get moving! Kickstart your new year by signing up to a challenge today and become a TeamGOSH hero in 2026. Until no childhood is lost to serious illness. Be part of it. Be a TeamGOSH hero today. Use code when you register for 50% off your fun-raising challenge and be a hero for childhood, for families, for seriously ill kids, for this generation and all those to come. Join us for 10th annual Tower Climb! For almost a decade, supporters like you have been taking on the tower. Will you step up this year for seriously ill kids? Climb 36 floors before being rewarded at the top with a celebratory drink and spectacular views of London from the beautiful Sky Garden to enjoy with friends or family. Saturday 28 March 2026 Fundraising pledge: 250 Registration fee: £30 (£15 with code NY50) The time you select during the registration for the Walkie Talkie Tower Climb is your arrival time. Arrival times are every 30 minutes from 8am until 12pm. You will take part in a warm-up 15 minutes after your arrival time and start your tower climb 30 minutes after. There are 36 floors in the Walkie Talkie building to take you up to the Sky Garden, which adds up to an impressive 896 steps! You can run, jog or walk your way to the Sky Garden in this stair climbing challenge whatever you feel most comfortable doing. Your friends and family are welcome to wait in the Sky Garden at the Walkie Talkie to see you cross the Tower Climb finishing line. Everyone is welcome to stay in the Sky Garden after their Tower Climb challenge to enjoy the stunning views of London. Everyone taking part in Walkie Talkie Tower Climb is asked to fundraise a minimum of £250 in sponsorship for Great Ormond Street Hospital Charity. This money will be used to help build a world-leading, child-focused Children’s Cancer Centre at Great Ormond Street Hospital, where more children can have the best chance and the best childhood possible. When you sign up, you will automatically be set up with a Funraisin fundrasing page. Get in touch with the Tower Climb team if you would like any fundraising materials or need any advice. Your registration fee goes towards the cost of putting on the Tower Climb event. Your registration fee goes towards the cost of putting on the event, and all funds raised will help build the new Children’s Cancer Centre at GOSH and save more lives. We need a new home to for breakthrough treatments, so we can save more children’s lives. And because cancer shouldn't get to steal anyone's childhood, we need a place that's more than a hospital – a place that's a school, a playground, a garden and so much more. That’s why we’re building a world-leading, child-focused Children’s Cancer Centre at GOSH, where more children can have the best chance and the best childhood possible. Together, we can build it. Together, we can help beat childhood cancer. There’s lots of ways that you can prepare for your stair climb challenge. Team GOSH recommend incline running or walking and other aerobic activities like swimming and cycling to build up your fitness. Don’t forget to incorporate some strength training into your programme, like squats and lunges. With this training combination you should be ready to tackle the stairs at the Walkie Talkie Tower Climb in no time. Read our frequently asked Tower Climb questions. Read the Walkie Talkie Tower Climb 2026 terms and conditions Great Ormond Street Hospital Children's Charity. A company limited by guarantee (company number ‍09338724) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
    "address": "4) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
    "coordinates": {
      "lat": 51.523323,
      "lon": -0.124458
    }
  }
},
{
  "category": "Charity Events",
  "site": "gosh",
  "url": "https://www.gosh.org/get-involved/fundraising-events/zurich-barcelona-marathon/",
  "name": "Barcelona Marathon 2026",
  "date": "03/15/2026",
  "raw_date": "15 March 2026",
  "short_description": "Explore and enjoy the vibrant Catalonian capital, with its coastal and mountainous landscape, like never before.",
  "coordinates": {
    "lat": 51.523323,
    "lon": -0.124458
  },
  "address": "4) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
  "subcategory": "Charity Events",
  "raw": {
    "title": "Barcelona Marathon 2026",
    "date": "03/15/2026",
    "desc_preview": "Explore and enjoy the vibrant Catalonian capital, with its coastal and mountainous landscape, like never before.",
    "full_description": "Explore and enjoy the vibrant Catalonian capital, with its coastal and mountainous landscape, like never before. A new, refreshed course is , taking you right through the urban, cosmopolitan centre. Marathon Sunday 15 March 2026 Barcelona, Spain Fundraising pledge: £400 Registration fee: £30 All GOSH Charity slots have been filled. We'll update the website when places go live for 2027. If you have already secured your own place directly through the organisers, we'd love for you to join our team and fundraise to help seriously ill children at Great Ormond Street Hospital (GOSH). There is no minimum fundraising commitment; we would only ask you to raise what you can. Both charity place and own place runners receive the same amazing support from our dedicated team. Great Ormond Street Hospital Charity (GOSH Charity) needs your support more than ever. By fundraising, you'll help to fund: A free GOSH Charity running top. A digital welcome pack full of tips, advice and fundraising materials. Access to professional training plans. Dedicated support from GOSH Charity's Challenge Events team. Great Ormond Street Hospital Children's Charity. A company limited by guarantee (company number ‍09338724) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
    "address": "4) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
    "coordinates": {
      "lat": 51.523323,
      "lon": -0.124458
    }
  }
},
{
  "category": "Charity Events",
  "site": "gosh",
  "url": "https://www.gosh.org/get-involved/fundraising-events/bath-half-marathon/",
  "name": "Bath Half Marathon 2026",
  "date": "03/15/2026",
  "raw_date": "15 March 2026",
  "short_description": "Run this 'big city' race starting and finishing in Bath's picturesque city centre all supporting a better future for seriously ill children.",
  "coordinates": {
    "lat": 51.523323,
    "lon": -0.124458
  },
  "address": "4) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
  "subcategory": "Charity Events",
  "raw": {
    "title": "Bath Half Marathon 2026",
    "date": "03/15/2026",
    "desc_preview": "Run this 'big city' race starting and finishing in Bath's picturesque city centre all supporting a better future for seriously ill children.",
    "full_description": "Run this 'big city' race starting and finishing in Bath's picturesque city centre all supporting a better future for seriously ill children. The Bath Half Marathon is known for its surprisingly flat course despite the city's hilly terrain through its unique two-lap course running either side of the river Avon valley. Sunday 15 March 2026 Bath, Somerset Fundraising pledge: £250 Registration fee: £25 The half marathon starts on Royal Avenue for the first lap taking you all along the rive Avon valley as you soak up Bath's stunning Georgian architecture before ending after the second lap on Queen Square for the finish. All GOSH Charity slots have been filled. We'll update the website when places go live for 2027. If you have already secured your own place directly through the organisers, we'd love for you to join our team and fundraise to help seriously ill children at Great Ormond Street Hospital (GOSH). There is no minimum fundraising commitment; we would only ask you to raise what you can. Both charity place and own place runners receive the same amazing support from our dedicated team. Great Ormond Street Hospital Charity (GOSH Charity) needs your support more than ever. By fundraising, you'll help to fund: A free GOSH Charity running top. A digital welcome pack full of tips, advice and fundraising materials. Access to professional training plans. Dedicated support from GOSH Charity's Challenge Events team. Great Ormond Street Hospital Children's Charity. A company limited by guarantee (company number ‍09338724) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
    "address": "4) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
    "coordinates": {
      "lat": 51.523323,
      "lon": -0.124458
    }
  }
},
{
  "category": "Charity Events",
  "site": "gosh",
  "url": "https://www.gosh.org/get-involved/fundraising-events/hampton-court-palace-half-marathon/",
  "name": "Hampton Court Palace Half Marathon 2026",
  "date": "03/15/2026",
  "raw_date": "15 March 2026",
  "short_description": "This is the only half marathon to start and finish at a historic royal palace. Hampton Court Palace is one of only two surviving palaces that King Henry VIII owned.",
  "coordinates": {
    "lat": 51.523323,
    "lon": -0.124458
  },
  "address": "4) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
  "subcategory": "Charity Events",
  "raw": {
    "title": "Hampton Court Palace Half Marathon 2026",
    "date": "03/15/2026",
    "desc_preview": "This is the only half marathon to start and finish at a historic royal palace. Hampton Court Palace is one of only two surviving palaces that King Henry VIII owned.",
    "full_description": "This is the only half marathon to start and finish at a historic royal palace. Hampton Court Palace is one of only two surviving palaces that King Henry VIII owned. Be a hero. Help save childhood. It’s time to get moving! Kickstart your new year by signing up to a challenge today and become a TeamGOSH hero in 2026. Until no childhood is lost to serious illness. Be part of it. Be a TeamGOSH hero today. on your registration fee when you sign up this January and be a hero for childhood, for families, for seriously ill kids, for this generation and all those to come. The race will start inside the gates of Hampton Court Palace and finish in its beautiful gardens. After you’ve finished your race you can visit the famous maze and the world’s largest grape vine. Running at this renowned venue offers not only a perfect opportunity to run a personal best, but also to run through UK’s rich and fascinating history. 13.1 Miles Sunday 15 March 2026 Hampton Court Palace, Surrey Fundraising pledge: £300 Registration fee: £25 (£12.5 with 50% off in January) Secure your place on the start line by registering for one of our charity places today. Great Ormond Street Hospital Children's Charity needs your support more than ever. By fundraising, you'll help to fund: A free GOSH Charity running top. A digital welcome pack full of tips, advice and fundraising materials. Access to professional training plans. Cheering points along the route for family and friends to join. Dedicated support from GOSH Charity's Challenge Events team. Great Ormond Street Hospital Children's Charity. A company limited by guarantee (company number ‍09338724) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
    "address": "4) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
    "coordinates": {
      "lat": 51.523323,
      "lon": -0.124458
    }
  }
},
{
  "category": "Charity Events",
  "site": "gosh",
  "url": "https://www.gosh.org/get-involved/fundraising-events/paris-half-marathon/",
  "name": "Paris Half Marathon 2026",
  "date": "03/08/2026",
  "raw_date": "08 March 2026",
  "short_description": "Join us for a unique half marathon experience in the most beautiful city in the world.",
  "coordinates": {
    "lat": 51.523323,
    "lon": -0.124458
  },
  "address": "4) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
  "subcategory": "Charity Events",
  "raw": {
    "title": "Paris Half Marathon 2026",
    "date": "03/08/2026",
    "desc_preview": "Join us for a unique half marathon experience in the most beautiful city in the world.",
    "full_description": "Join us for a unique half marathon experience in the most beautiful city in the world. The Harmonie Mutuelle Semi de Paris is one of the biggest half marathons in the world and perfectly combines a personal challenge with the chance to discover one of the world's greatest cities. Every year, this unique and spectacular setting attracts more and more entrants and each finisher comes home with incredible memories. 13.1 miles Sunday 08 March 2026 Paris, France Fundraising pledge: £350 Registration fee: £35 The Harmonie Mutuelle Semi de Paris offers a unique opportunity to make the city yours by participating in one of the most prestigious races over the legendary 13.1 mile distance. Tens of thousands of runners gather to tackle the most fabled long-distance discipline in athletics. This race across Paris, offers an incomparable backdrop, with spectacular views and landmarks all along the route. Secure your place on the start line by registering for one of our charity places today. Registration fee: £30. Fundraising target: £350 (excluding Gift Aid). If you have already secured your own place directly through the organisers, we'd love for you to join our team and fundraise to help seriously ill children at Great Ormond Street Hospital (GOSH). There is no minimum fundraising commitment; we would only ask you to raise what you can. Both charity place and own place runners receive the same amazing support from our dedicated team. The Paris Half Marathon is France's biggest half marathon, taking place in the streets of the capital, Paris. The event features over 48,000 participants and covers iconic locations such as the boulevard Saint Germain, quais de Seine, Bibliothèque Nationale de France, château de Vincennes, Hôtel de Ville, rue de Rivoli, and place de la Bastille. Great Ormond Street Hospital Charity needs your support more than ever. By fundraising, you'll help to fund: A free GOSH running top. A digital welcome pack full of tips, advice and fundraising materials. Access to professional training plans. Dedicated support from GOSH Charity's Challenge Events team. Great Ormond Street Hospital Children's Charity. A company limited by guarantee (company number ‍09338724) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
    "address": "4) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
    "coordinates": {
      "lat": 51.523323,
      "lon": -0.124458
    }
  }
},
{
  "category": "Charity Events",
  "site": "gosh",
  "url": "https://www.gosh.org/get-involved/fundraising-events/run-100km-in-february-2026/",
  "name": "Run 100km in February 2026",
  "date": "02/28/2026",
  "raw_date": "28 February 2026",
  "short_description": "Take on the challenge whichever way suits you best. Split your runs up in the best way for your ability and make the challenge your own.",
  "coordinates": {
    "lat": 51.523323,
    "lon": -0.124458
  },
  "address": "4) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
  "subcategory": "Charity Events",
  "raw": {
    "title": "Run 100km in February 2026",
    "date": "02/28/2026",
    "desc_preview": "Take on the challenge whichever way suits you best. Split your runs up in the best way for your ability and make the challenge your own.",
    "full_description": "Take on the challenge whichever way suits you best. Split your runs up in the best way for your ability and make the challenge your own. 1 February to 28 February 2026 Registration fee: Free There are three easy steps to get set up: For questions please email us at or call us on 020 3841 3131. Great Ormond Street Hospital Children's Charity. A company limited by guarantee (company number ‍09338724) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
    "address": "4) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
    "coordinates": {
      "lat": 51.523323,
      "lon": -0.124458
    }
  }
},
{
  "category": "Charity Events",
  "site": "gosh",
  "url": "https://www.gosh.org/get-involved/fundraising-events/londonwinterwalk/",
  "name": "London Winter Walk 2026",
  "date": "01/24/2026",
  "raw_date": "24 Jan 2026",
  "short_description": "A great way to kickstart the New Year",
  "coordinates": {
    "lat": 51.523323,
    "lon": -0.124458
  },
  "address": "4) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
  "subcategory": "Charity Events",
  "raw": {
    "title": "London Winter Walk 2026",
    "date": "01/24/2026",
    "desc_preview": "A great way to kickstart the New Year",
    "full_description": "A great way to kickstart the New Year Take in highlights of the Thames, its historic bridges, and many of the Capital’s key landmarks with the London Winter Walk. Starting and finishing at The Oval Cricket Ground, there will be rest stops with snacks and hot food at the finish. Experience the ‘Ultra Challenge’ support and hospitality all the way, helping you to push yourself further and achieve something really special. With Full Marathon, Half Marathon and 10k options, as well as an accessible 'Family Fun 5k' option (Sunday only), there's a challenge for everyone. Join as an individual or a team. ! 24 Jan 2026 to 25 Jan 2026 London Visit the Ultra Challenge website for full details on distances, prices, and to sign up. Great Ormond Street Hospital Charity (GOSH Charity) needs your support more than ever. By fundraising, you'll help to fund: a special medal A GOSH Charity t-shirt Rest stops with snacks and drinks, including hot food at the finish Inclusive and fun event with a great atmosphere and camaraderie Dedicated support from GOSH Charity's Challenge Events team Lace up those walking boots and trek for seriously ill children at Great Ormond Street Hospital. Great Ormond Street Hospital Children's Charity. A company limited by guarantee (company number ‍09338724) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
    "address": "4) and a registered charity (charity number ‍1160024). Registered office: 40 Bernard Street, London WC1N 1LE.",
    "coordinates": {
      "lat": 51.523323,
      "lon": -0.124458
    }
  }
}
]