[
{
  "category": "Wellness & Mind",
  "site": "mindfulnessuk",
  "url": "https://mindfulnessuk.com/retreats/",
  "name": "Mindfulness Meditation Retreats UK",
  "date": "Aug 27, 2025",
  "raw_date": "Aug 27, 2025",
  "short_description": "Mindfulness Meditation Retreats UK",
  "coordinates": null,
  "address": null,
  "subcategory": "Mindfulness",
  "raw": {
    "title": "Mindfulness Meditation Retreats UK",
    "date": "Aug 27, 2025",
    "desc_preview": "Mindfulness Meditation Retreats UK",
    "full_description": "Mindfulness Meditation Retreats UK To support your well-being join one of our meditation retreats. More About MindfulnessUK Online Retreats for All All our online retreats are open to anyone, from complete beginners to trained Mindfulness Teachers.  A retreat gives you the opportunity to rest and revitalise through gentle, guided practices in the comfort of your own home. They also count towards the British Association of Mindfulness-Based Approaches (BAMBA) Good Practice Guidelines (GPGs). Benefits of doing a Retreat R Decompress through the practices of mindfulness and compassion practices. R Decompress through the practices of mindfulness and compassion practices. R Decompress through the practices of mindfulness and compassion practices. View Retreat Dates All retreats are recorded, so even if you cannot attend please book the Retreat, on booking you will be requested to complete an assessment form where you can confirm your attendance or if you only want the recording.    If you are attending in person, the morning session is mandatory. Attending on the day and/or retreating via the recording in your own time all meet the BAMBA GPGs. PLEASE NOTE:  It can take up to a week to send out the recording as we edit it before distributing. Community Full Members receive 10% off all retreats – please ensure you are logged in when booking and the discount is applied automatically. Purchase a Past Retreat Past Retreats can be purchased retrospectively and are listed below, to find out more about the retreat click on the title – you can purchase from that info screen. Finding Joy The Heart of Self-Compassion Deeply Rest and Heal Nourish through Stillness and Movement Care and Compassion Nourish & Nurture your heart Healing Hibernation: a mid-winter retreat to deeply rest and replenish Love Yourself: A Valentine’s mindfulness and compassion retreat Living life to the fullest Find Inner Peace 4 Immeasurables of Kindness, Compassion, Joy and Equanimity Creating a nurturing cocoon Next Retreats The retreats are recorded so if you can’t join us on the day, please purchase beforehand to watch at your leisure. Everyone gets the recording to revisit the practices as often as you wish. NOTE: Bookings close at 10pm the day before the retreat (+10% off for members)  30th Dec 2025 Creating a Nurturing Cocoon 10:00 – 16:00 During the winter months we especially need warmth, nurture, replenishment and self-care. Join us for supportive, rejuvenative mindfulness and compassion practices, resting deeply and moving in kind ways that restore and energise. £ 75 Enrol NOW  6th Mar 2026 Awakening into Spring 10:00 – 16:00 As the Earth reawakens from her slumber, we too emerge into a period of renewal and new beginnings. Join us for a restorative day of mindfulness and compassion practices to support wellbeing, reflection and renewal, moving into the Spring with intention, care and non-judgemental awareness. £ 75 Enrol NOW The Impact of Mindfulness in Secure Services Aug 27, 2025 Why Mindfulness Matters: Science, Benefits & Everyday Impact Aug 20, 2025",
    "address": null,
    "coordinates": null
  }
}
]