[
{
  "category": "Wellness & Mind",
  "site": "yogawithmanon",
  "url": "https://yogawithmanon.co.uk/retreats/",
  "name": "RETREATS",
  "date": null,
  "raw_date": null,
  "short_description": "From 3pm – ARRIVAL, CHECK-IN AND CHILL- OUT.",
  "coordinates": null,
  "address": null,
  "subcategory": "Yoga",
  "raw": {
    "title": "RETREATS",
    "date": null,
    "desc_preview": "From 3pm – ARRIVAL,  CHECK-IN AND CHILL- OUT.",
    "full_description": "From 3pm – ARRIVAL,  CHECK-IN AND CHILL- OUT. 5pm – WELCOME  in Shala (Lakeside suite) with tea and cake followed by YOGA  stretch & decompress  – please wear your yoga clothes and bring all your yoga  gear. All items can remain in the Shala for the duration of our stay. 7pm – 3 course dinner in Ogilvie Restaurant 9pm –  relaxing yoga 7.30 am active yoga session to greet a new day, INCLUDING sun salutations and mantra From 8am breakfast in Ogilvie restaurant, made to order from the breakfast menu and Continental buffet 10am – 11.30 yoga in Shala – a multitude of practices suitable for all 11.30 – 12.00 tea break 12.00-12.45 yoga in Shala – deep relaxation 1pm Lunch – soup and sandwiches in the BAR areafree time 4pm A workshop to enhance and deepen the Restore and Revitalise experience. 6.30pm – a little time to get a drink from the bar, if you like 7pm 2 course dinner in Ogilvie restaurant 9pm YOGA NIDRA in Shala  – you can come in your PJ’s if you like and be prepared for a smooth transition to bed. Unless …………………… you fancy a nightcap in the lounge afterwards. 7.30 yoga in Shala 9am breakfast in Ogilvie restaurant 10am goodbyes after breakfast in the restaurant, vacate rooms by 10am 10am onwards, You are very welcome to play a round of minigolf if you like, get your golf clubs from reception (INCLUDED in PRICE)  or go for a walk in this AONB, or visit Aldeburgh before you head home. Programme might be subject to change. You will be looked after by our team of specialist in their field with a curated programme designed to leave you feeling stronger in your body and in a more tranquil mental state. It combines outdoor and indoor activities and a tasty nutrient dense menu in a relaxed setting. It  will help you feel refreshed and  invigorated ahead of summer. A digital detox is recommended. Suffolk Escapes Terms and conditions apply LIMITED SPACES FROM £995 per person for 1 night including accommodation, full board, 4 sessions with Manon. Extra treatments from £95 Your bespoke solo retreat is specifically tailored to your needs and  is focused on personalised energy work, yoga, somatic movement,  yogic therapies and techniques to achieve a soul-centred solution to empower you to empower yourself. Your programme is carefully curated after a consultation and your stay will be overseen from start to finish. You will stay in a soulful and relaxing space near the sea in Suffolk. Other holistic therapies and practices can also be arranged for you, depending on your needs. My team of skilled therapists can include massage, reflexology, sound healing, biomechanical therapy, Indian head massage and somatic trauma release.",
    "address": null,
    "coordinates": null
  }
}
]